// Задача 6
// Напишите программу, 
// которая на вход принимает число и выдает , 
// является ли число четным (делится ли оно на 2 без остатка)
int n = Convert.ToInt32(Console.ReadLine()); 
if (n % 2 == 0)               
    Console.WriteLine("Да");               
else                                         
Console.WriteLine("Нет");
