// Задача 8
// Напишите программу, 
// которая на вход принимает число (N), 
// а на выходе показывает все четные числа от 1 до N

int n = Convert.ToInt32(Console.ReadLine());  
for (int i = 2; i <= n; i+=2)    

 
    Console.Write(i + " ");
